// let i = 0;
// while (++i < 5) alert(i);

// 1 < 5  ==> alert(1)
// 2 < 5  ==> alert(2)
// 3 < 5 ==> alert(3)
// 4 < 5 ==> alert(4)
// 5 < 5 ==> end

// let i = 0;
// while (i++ < 5) alert(i);

// 0 < 5 ==> 1 ==> alert(1)
// 1 < 5 ==> 2 ==> alert(2)
// 2 < 5 ==> 3 ==> alert(3)
// 3 < 5==> 4 ==> alert(4)
// 4 < 5 ==> 5 ==> alert(5)

let a = 0;   // 0
while (++a < 5) alert(a);    // 1 -> 1 ,2->2,3->3,4->4

let i = 0;  //0
while (i++ < 5) alert(i); // 0 -> 1 , 1-> 2 , 2->3 ,3->4, 4->5 


// i++ => ค่าเดิมก่อน เเต่ถ้าใครเรียกใช้ i อีก จึงจะอัพเดตค่า